---
title: FabricFailures
classe: Autodesk.Revit.DB.BuiltInFailures+FabricFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 28
---

# FabricFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId BendDiameterNegative { get; }` | `FabricFailures.BendDiameterNegative` | FailureDefinitionId |
| `FailureDefinitionId BendPolylineInvalid { get; }` | `FabricFailures.BendPolylineInvalid` | FailureDefinitionId |
| `FailureDefinitionId BentHiddenWires { get; }` | `FabricFailures.BentHiddenWires` | FailureDefinitionId |
| `FailureDefinitionId CannotPlaceFabricArea { get; }` | `FabricFailures.CannotPlaceFabricArea` | FailureDefinitionId |
| `FailureDefinitionId CannotPlaceFabricAreaWarn { get; }` | `FabricFailures.CannotPlaceFabricAreaWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotPlaceFabricSheet { get; }` | `FabricFailures.CannotPlaceFabricSheet` | FailureDefinitionId |
| `FailureDefinitionId CannotPlaceFabricSheetWarn { get; }` | `FabricFailures.CannotPlaceFabricSheetWarn` | FailureDefinitionId |
| `FailureDefinitionId CoverOffsetTooLong { get; }` | `FabricFailures.CoverOffsetTooLong` | FailureDefinitionId |
| `FailureDefinitionId CoverOffsetTooLongTemp { get; }` | `FabricFailures.CoverOffsetTooLongTemp` | FailureDefinitionId |
| `FailureDefinitionId FabricAreaWrongHost { get; }` | `FabricFailures.FabricAreaWrongHost` | FailureDefinitionId |
| `FailureDefinitionId FabricAreaWrongLapSplice { get; }` | `FabricFailures.FabricAreaWrongLapSplice` | FailureDefinitionId |
| `FailureDefinitionId FabricAreaWrongSheetAlignment { get; }` | `FabricFailures.FabricAreaWrongSheetAlignment` | FailureDefinitionId |
| `FailureDefinitionId FabricSheetWrongHost { get; }` | `FabricFailures.FabricSheetWrongHost` | FailureDefinitionId |
| `FailureDefinitionId MajorLapSpliceFailure { get; }` | `FabricFailures.MajorLapSpliceFailure` | FailureDefinitionId |
| `FailureDefinitionId MajorOverhangFailure { get; }` | `FabricFailures.MajorOverhangFailure` | FailureDefinitionId |
| `FailureDefinitionId MajorSpacingFailure { get; }` | `FabricFailures.MajorSpacingFailure` | FailureDefinitionId |
| `FailureDefinitionId MinorLapSpliceFailure { get; }` | `FabricFailures.MinorLapSpliceFailure` | FailureDefinitionId |
| `FailureDefinitionId MinorOverhangFailure { get; }` | `FabricFailures.MinorOverhangFailure` | FailureDefinitionId |
| `FailureDefinitionId MinorSpacingFailure { get; }` | `FabricFailures.MinorSpacingFailure` | FailureDefinitionId |
| `FailureDefinitionId NoSurfPatternOnWire { get; }` | `FabricFailures.NoSurfPatternOnWire` | FailureDefinitionId |
| `FailureDefinitionId NoWireMaterialDensity { get; }` | `FabricFailures.NoWireMaterialDensity` | FailureDefinitionId |
| `FailureDefinitionId WireDiameterTooLarge { get; }` | `FabricFailures.WireDiameterTooLarge` | FailureDefinitionId |
| `FailureDefinitionId WrongFabricSheetEndOverhang { get; }` | `FabricFailures.WrongFabricSheetEndOverhang` | FailureDefinitionId |
| `FailureDefinitionId WrongFabricSheetLayoutPattern { get; }` | `FabricFailures.WrongFabricSheetLayoutPattern` | FailureDefinitionId |
| `FailureDefinitionId WrongFabricSheetNumberOfWires { get; }` | `FabricFailures.WrongFabricSheetNumberOfWires` | FailureDefinitionId |
| `FailureDefinitionId WrongFabricSheetOverallLength { get; }` | `FabricFailures.WrongFabricSheetOverallLength` | FailureDefinitionId |
| `FailureDefinitionId WrongFabricSheetSpacing { get; }` | `FabricFailures.WrongFabricSheetSpacing` | FailureDefinitionId |
| `FailureDefinitionId WrongFabricSheetStartOverhang { get; }` | `FabricFailures.WrongFabricSheetStartOverhang` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```